# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#phượng thay đổi code

# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11-seg instance segmentation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-seg.yaml' will call yolo11-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 355 layers, 2876848 parameters, 2876832 gradients, 10.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 355 layers, 10113248 parameters, 10113232 gradients, 35.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 445 layers, 22420896 parameters, 22420880 gradients, 123.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 667 layers, 27678368 parameters, 27678352 gradients, 143.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 667 layers, 62142656 parameters, 62142640 gradients, 320.2 GFLOPs

backbone:
  - [-1, 2, C3TR, [256, 1, True, 1, 0.5]]
  - [-1, 2, C3TR, [512, 1, True, 1, 0.5]]
  - [-1, 2, C3TR, [1024, 1, True, 1, 0.5]]

head:
  - [-1, 2, C3TR, [512, 1, True, 1, 0.5]]
  - [-1, 2, C3TR, [256, 1, True, 1, 0.5]]
  - [-1, 2, C3TR, [1024, 1, True, 1, 0.5]]
